In [5]:
import pandas as pd

# 2 main datatypes
 - Series --> 1-dimesional
 - Data frames --> 2-dimesional

# 1-Series

In [16]:
brands = pd.Series((['BMW', 'Toyota', 'Honda']))
brands

In [18]:
colors = pd.Series(['Blue', 'Red', 'White'])
colors

# 2-Data frame

In [21]:
car_data = pd.DataFrame({'Car make': brands, 'color': colors})
car_data

  Car make  color
0      BMW   Blue
1   Toyota    Red
2    Honda  White

# import data

In [39]:
car_df = pd.read_csv('car-sale.csv')
car_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describe data

In [33]:
# attribute --> Don't need()
car_df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [35]:
car_df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [37]:
car_df.index

RangeIndex(start=0, stop=10, step=1)

In [41]:
car_df.describe() # Only for numeric column

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [43]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [46]:
car_df.mean() # show us the average of numrical columns

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [48]:
car_prices = pd.Series([2000, 4000, 10000])
car_prices.mean()

5333.333333333333

In [50]:
car_df.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [53]:
car_df['Doors'].sum() # sum of specific column

40

In [54]:
len(car_df) # show us the rows of car_df

10

# Viewing and selecting data

In [57]:
car_df.head() # to see the head(n) ==> n lines of head of df (default is 5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [58]:
car_df.tail() # to see the tail(n) ==> n lines of tail of df

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [62]:
animals = pd.Series(['cat', 'dog', 'bird', 'panda', 'snake'],
                   index=[1, 2, 3, 1, 5])
animals

1      cat
2      dog
3     bird
1    panda
5    snake
dtype: object

In [67]:
animals.loc[1] # use loc(location)[] ==> refers to index

1      cat
1    panda
dtype: object

In [68]:
car_df.loc[2]

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

In [70]:
animals

1      cat
2      dog
3     bird
1    panda
5    snake
dtype: object

In [71]:
animals.iloc[3] # iloc refers to postions

'panda'

In [72]:
car_df.iloc[2]

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

In [74]:
animals.iloc[:4]

1      cat
2      dog
3     bird
1    panda
dtype: object

In [75]:
car_df.loc[:6]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [76]:
car_df['Make']

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [80]:
car_df['Colour']

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [82]:
car_df.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [83]:
car_df[car_df['Make'] == 'Toyota'] # boolean indexing

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [87]:
car_df[car_df['Odometer (KM)'] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

# Export

In [ ]:
car_df.to_csv('exported_car.csv', index=False)